Repository: SadLife257/flutter_gfi
Catalog: lib/core/translation/languages/app_*.arb
Languages: vi

# language
source: English
vi: Tiếng Việt

# language_code
source: en
vi: vi

source: Confirm
vi: Đồng ý

# confirm_required
source: Please confirm
vi: Xin hãy xác nhận

# confirm_cap
source: CONFIRM
vi: ĐỒNG Ý

source: Cancel
vi: Hủy

# cancel_cap
source: CANCEL
vi: HỦY

source: Save
vi: Lưu

# save_cap
source: SAVE
vi: LƯU

source: Send
vi: Gửi

# send_cap
source: SEND
vi: GỬI

source: Re-Send
vi: Gửi lại

# resend_cap
source: RE-SEND
vi: GỬI LẠI

source: Delete
vi: Xóa

# delete_cap
source: DELETE
vi: XÓA

source: Next
vi: Tiếp theo

# next_cap
source: NEXT
vi: TIẾP THEO

source: Skip
vi: Bỏ qua

# skip_cap
source: SKIP
vi: BỎ QUA

source: Finish
vi: Hoàn tất

# finish_cap
source: FINISH
vi: HOÀN TẤT

source: Upload
vi: Chọn ảnh

# upload_cap
source: UPLOAD
vi: CHỌN ẢNH

source: Welcome
vi: Chào mừng

# welcome_home
source: Welcome home {name}
vi: Chào bạn {name}

# welcome_cap
source: WELCOME
vi: CHÀO MỪNG

source: Login
vi: Đăng nhập

# login_cap
source: LOGIN
vi: ĐĂNG NHẬP

source: Logout
vi: Đăng xuất

# logout_cap
source: LOGOUT
vi: ĐĂNG XUẤT

source: Register
vi: Đăng ký

# register_cap
source: REGISTER
vi: ĐĂNG KÝ

source: Setting
vi: Cài đặt

# setting_cap
source: SETTING
vi: CÀI ĐẶT

source: Username
vi: Tên người dùng

source: First Name
vi: Tên

# firstname_hint
source: Enter your first name
vi: Nhập tên của bạn

# firstname_error_empty
source: Please enter your first name
vi: Xin nhập tên của bạn

source: Last Name
vi: Họ và tên lót

# lastname_hint
source: Enter your last name
vi: Nhập họ và tên lót của bạn

# lastname_error_empty
source: Please enter your last name
vi: Xin nhập họ và tên lót của bạn

source: Confirm Password
vi: Xác nhận mật khẩu

# confirm_password_hint
source: Enter your password again
vi: Nhập mật khẩu của bạn lần nữa

# confirm_password_error_empty
source: Please enter your password again
vi: Xin nhập mật khẩu của bạn lần nữa

# password_error_confirm_wrong
source: Password are incorrect
vi: Mật khẩu không chính xác

# email_hint
source: Enter your email
vi: Nhập email của bạn

# email_error_empty
source: Please enter email
vi: Xin nhập email của bạn

source: Password
vi: Mật khẩu

# password_hint
source: Enter your password
vi: Nhập mật khẩu của bạn

# password_error_empty
source: Please enter password
vi: Xin nhập mật khẩu của bạn

# forgot_pass
source: Forgot Password?
vi: Quên mật khẩu?

# login_alternative
source: Or continue with
vi: Hoặc đăng nhập bằng

# not_member
source: Not a member
vi: Không có tài khoản

source: Join us
vi: Tạo tài khoản

# already_have_account
source: Already have an account!
vi: Đã có tài khoản!

source: Login now
vi: Đăng nhập ngay

# check_email
source: Check your email
vi: Kiểm tra email của bạn

# check_email_explain
source: We've sent you a verification email
vi: Email xác nhận đã được gửi cho bạn

# empty_home
source: Is seem like you have no active devices
vi: Bạn chưa kết nối đến thiết bị nào

# empty_home_explain
source: Start add room for your devices!!!
vi: Hãy bắt đầu tạo phòng và kết nối thiết bị!!!

# reset_pass
source: Reset Password
vi: Thay đổi mật khẩu

# reset_pass_explain
source: Enter your email, and we will send you a reset password
vi: Hãy nhập email và chúng tôi sẽ gửi link thay đổi mật khẩu cho bạn

# reset_pass_success
source: We've sent a password reset link to your email
vi: Chúng tôi đã gửi link thay đổi mật khẩu cho bạn

# reset_pass_fail
source: This email haven't sign up
vi: Email này chưa được dùng để đăng ký

source: Device
vi: Thiết bị

source: Devices
vi: Thiết bị

# device_scan
source: Scan Device
vi: Quét mã thiết bị

# device_scan_wrong
source: Wrong QR code
vi: Sai mã QR

# device_scan_wrong_explain
source: It seem like you scan the wrong QR to connect to our device
vi: Bạn đã quét sai mã QR để kết nối với thiết bị này

source: Device Setting
vi: Cài đặt thiết bị

# device_name_label
source: Device Name
vi: Tên thiết bị

source: Device name changed success!
vi: Thay đổi tên thiết bị thành công!

source: Device name changed fail!
vi: Thay đổi tên thiết bị thất bại!

# device_name_error_empty
source: Please enter your device name
vi: Xin nhập tên thiết bị của bạn

# device_delete_name
source: Delete {device_name}
vi: Xóa {device_name}

source: Notification
vi: Thông báo

# notification_permission
source: Please allow notification in your
vi: Xin hãy cho phép chúng tôi gửi thông báo cho bạn

source: Room
vi: Phòng

source: Rooms
vi: Phòng

# room_add_explain
source: Add New Room to Your Home
vi: Thêm phòng mới

source: Room Name
vi: Tên phòng

source: Room name changed success!
vi: Thay đổi tên phòng thành công!

source: Room name changed fail!
vi: Thay đổi tên phòng thất bại!

# room_name_hint
source: Room Name
vi: Tên phòng

# room_name_error_empty
source: Please enter your room name
vi: Xin nhập tên phòng của bạn

# room_name_error_exist
source: Room name already exist!
vi: Tên phòng đã tồn tại!

# room_name_error_same
source: Please use a new room name!
vi: Tên phòng mới trùng với tên phòng cũ!

source: Room Management
vi: Quản lý phòng

# room_delete_name
source: Delete {room_name}
vi: Xóa {room_name}

source: Profile
vi: Tài khoản

# profile_info
source: User Information
vi: Thông tin tài khoản

# profile_operation
source: User Operation
vi: Hỗ trợ

# profile_img_pick_fail
source: Pick profile image failed!
vi: Chọn hình ảnh không thành công!

# profile_img_upload_success
source: Upload profile image successful!
vi: Thay đổi ảnh thành công!

# profile_img_upload_fail
source: Upload profile image failed!
vi: Thay đổi ảnh thất bại!

source: Manage Home
vi: Quản lý nhà

source: Add Room
vi: Thêm phòng

source: Manage App
vi: Quản lý thiết bị

source: threshold
vi: ngưỡng cho phép

source: On
vi: Bật

source: Off
vi: Tắt

# setting_language_label
source: Please select a language
vi: Hãy chọn ngôn ngữ của bạn

# setting_theme
source: {locale, select, dark {Dark Mode} light {Light Mode} other {-}}
vi: {locale, select, dark {Chế độ tối} light {Chế độ sáng} other {-}}

# onboard_detail
source: 1|Welcome|Hey there! Let's get started with how you can monitor and protect your home from fire and gas poisoning.#2|Connect to Device|Simply, create a room that you want to monitor, and scan our device connection code.#3|Receive Alert|When we detect a gas build-up in your room, we will send you a notification.#4|Remote Control|You can safely turn off the gas valve from anywhere with your phone.#5|Enjoy|That's about it, thank you for choosing our product.
vi: 1|Chào mừng|Hãy cùng xem qua cách để bảo vệ ngôi nhà của bạn khỏi cháy và ngộ độc khí ga nhé.#2|Kết nối thiết bị|Đầu tiên, tạo phòng và kết nối với thiết bị qua mã kết nối#3|Nhận thông báo|Khi thiết bị phát hiện lượng khí ga lớn, chúng tôi sẽ gửi thông báo cho bạn#4|Điều khiển từ xa|Bạn có thể tắt van ga từ xa thông qua điện thoại#5|Xong rồi|Chỉ đơn giản vậy thôi, cảm ơn bạn đã chọn sản phẩm của chúng tôi.

source: About Us
vi: Về chúng tôi

# about_us_cap
source: ABOUT US
vi: VỀ CHÚNG TÔI

# about_us_explain
source: GFI - Gas and Fire Intelligence is our team Information Technology Project to improve fire safety for family and businesses by offering an insight into their temperature, gas concentration, etc, ... remotely through their devices.
vi: GFI - Gas and Fire Intelligence là Dự án Công nghệ thông tin của nhóm chúng tôi nhằm cải thiện an toàn cháy nổ cho gia đình và doanh nghiệp bằng cách cung cấp thông tin chi tiết về nhiệt độ, nồng độ khí, v.v., ... từ xa thông qua thiết bị của họ.

source: This Project
vi: Về dự án này

# this_project_explain
source: This app is a part of our project which uses platforms like Android and iOS to provide our service to hand-held devices aiming for family members.
vi: Ứng dụng này là một phần trong dự án của chúng tôi sử dụng các nền tảng như Android và iOS để cung cấp dịch vụ của chúng tôi cho các thiết bị cầm tay hướng tới các thành viên trong gia đình.

source: Our Team
vi: Nhóm chúng tôi

# our_team_introduction
source: Our team consists of two members Lâm Quốc Huy, majoring in Computer Science at Tôn Đức Thắng University, and Nguyễn Lê Gia Bảo, majoring in Software Technology at Tôn Đức Thắng University.
vi: Nhóm của chúng tôi gồm có hai thành viên Lâm Quốc Huy, chuyên ngành Khoa học máy tính tại Đại học Tôn Đức Thắng và Nguyễn Lê Gia Bảo, chuyên ngành Kỹ thuật phần mềm tại Đại học Tôn Đức Thắng.

# team_member_major_Huy
source: Computer Science
vi: Khoa học máy tính

# team_member_university_Huy
source: Tôn Đức Thắng University
vi: Đại học Tôn Đức Thắng

# team_member_major_Bao
source: Software Technology
vi: Kỹ thuật phần mềm

# team_member_university_Bao
source: Tôn Đức Thắng University
vi: Đại học Tôn Đức Thắng
